<a href="https://colab.research.google.com/github/Rahullnitp/Data_Cleaning_And_Preprocessing/blob/master/Data_Creation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Dataset creation

In [0]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

##A).Creating Pandas Dataframe with Random values

####i).Data creation using "random.randn"

       
randn create a dataset with normal distribution with mean = 0 and variance = 1.

In [0]:
#dataset with 1000 rows and 4 columns
data=pd.DataFrame(np.random.randn(1000,4),columns=list('ABCD'))

In [35]:
data.head()

          A         B         C         D
0 -0.408168 -0.131834  2.352565 -0.330793
1 -1.187770  0.052494 -0.531552 -0.383105
2 -0.797046  0.524647 -1.871773 -0.434058
3  0.508564 -1.207465 -1.392484 -1.145060
4 -0.293038  1.889040 -0.002710  0.342555

###ii).Data Creation using "random.randint"

Return random integers from the “discrete uniform” distribution of the specified dtype in the “half-open” interval [low, high). If high is None (the default), then results are from [0, low).

In [0]:
data1=pd.DataFrame(np.random.randint(0,100,size=(1000,4)),columns=list('ABCD'))

In [37]:
data1.head()

    A   B   C   D
0  72  92  68  91
1   8  37  70  62
2   9  73   5   4
3   8  37  67  25
4  96   9  42  76

###iii).Data creation with some null values in it.

create a dataframe with approximately 10% null values.

In [0]:
data_null=pd.DataFrame(np.random.randn(1000,4),columns=list('ABCD'))

In [39]:
data_null.head()

          A         B         C         D
0  0.481733  2.383084  3.048952 -0.697811
1 -0.241648 -1.060172  0.386040  1.335223
2 -1.008727 -1.992962  1.612532  0.228753
3 -1.496945 -0.653131  0.708225  0.695917
4  0.696000  0.377915  1.988238 -0.476976

In [0]:
data_null = data_null.mask(np.random.random(data_null.shape)< .1)   # difference bn "random.random" and "random.randn" by this link --https://stackoverflow.com/questions/47231852/np-random-rand-vs-np-random-random

In [41]:
data_null.head()

          A         B         C         D
0  0.481733  2.383084  3.048952 -0.697811
1 -0.241648       NaN  0.386040  1.335223
2 -1.008727 -1.992962  1.612532  0.228753
3 -1.496945       NaN  0.708225  0.695917
4  0.696000  0.377915  1.988238 -0.476976

###iv).Data with some categorical features

create a column with some categorical values

In [0]:
data_null['category'] = np.random.choice(a=['A', 'B', 'C', 'D'],size=1000,p=[0.4, 0.3, 0.2,0.1]  )  #adding a categorical feature .

In [43]:
data_null.head()

          A         B         C         D category
0  0.481733  2.383084  3.048952 -0.697811        A
1 -0.241648       NaN  0.386040  1.335223        A
2 -1.008727 -1.992962  1.612532  0.228753        A
3 -1.496945       NaN  0.708225  0.695917        A
4  0.696000  0.377915  1.988238 -0.476976        A

##B).Creating Pandas Dataframe with defined values

####i). Creating  DataFrame from lists of lists.

In [44]:
df=[['a',5],['b',6],['c',7],['d',8]]
df=pd.DataFrame(df,columns=['Name','values'])
df

  Name  values
0    a       5
1    b       6
2    c       7
3    d       8

####ii).Creating Dataframe from dict of list

In [45]:
data = {'Name':['m', 'k', 'kr', 'j','f','h'], 'Age':[2,3,4,5,6,7]}
data=pd.DataFrame(data)
data

  Name  Age
0    m    2
1    k    3
2   kr    4
3    j    5
4    f    6
5    h    7

####iii).Creating a indexed Dataframe using arrays.

In [46]:
ata = {'Name':['m', 'k', 'kr', 'j','f','h'], 'Age':[2,3,4,5,6,7]}
data=pd.DataFrame(data,index=['a','b','c','d','e','f'])
data

  Name  Age
a  NaN  NaN
b  NaN  NaN
c  NaN  NaN
d  NaN  NaN
e  NaN  NaN
f  NaN  NaN

####iv).Creating DataFrame from list of dictionary

In [47]:
data = [{'a': 1, 'b': 2}, {'a':0, 'b': 2, 'c': 3}] 
data=pd.DataFrame(data,index=['one','two'])
data

     a  b    c
one  1  2  NaN
two  0  2  3.0

####v).Creating pandas Dataframe using zip() function

In [48]:
Name = ['om', 'kr', 'nk', 'li']
Value=[3,5,6,7]
dat=list(zip(Name,Value))
dat                       #list of tuples

[('om', 3), ('kr', 5), ('nk', 6), ('li', 7)]

In [49]:
data=pd.DataFrame(dat,columns=['Name','Value'])
data

  Name  Value
0   om      3
1   kr      5
2   nk      6
3   li      7

####vi).Creating DataFrame from Dicts of series.

In [50]:
d = {'one' : pd.Series([10, 20, 30, 40], index =['a', 'b', 'c', 'd']), 
      'two' : pd.Series([10, 20, 30, 40], index =['a', 'b', 'c','e'])} 
df = pd.DataFrame(d)  
df

    one   two
a  10.0  10.0
b  20.0  20.0
c  30.0  30.0
d  40.0   NaN
e   NaN  40.0